---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralBaseFinishingTurns
source: html/e49c21d7-8199-3316-88f3-bac92bc364be.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralBaseFinishingTurns Property

"Base Finishing Turns"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeSpiralBaseFinishingTurns { get; }
```